In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
df=pd.DataFrame({'name':["Amar","Akbar","Anthony"],'age':["23","20","31"],'occupation':["doctor","architect","Engineer"]},columns=['name','age','occupation'],index=['1','2','3'])

In [6]:
df

      name age profession
1     Amar  23        NaN
2    Akbar  20        NaN
3  Anthony  31        NaN

In [14]:
f=pd.read_csv(r'C:\Users\tahuj\Desktop\airline-safety.csv')
f.head()

,airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99,fatalities_85_99,incidents_00_14,fatal_accidents_00_14,fatalities_00_14
0,Aer Lingus,320906734,2,0,0,0,0,0
1,Aeroflot*,1197672318,76,14,128,6,1,88
2,Aerolineas Argentinas,385803648,6,0,0,1,0,0
3,Aeromexico*,596871813,3,1,64,5,0,0
4,Air Canada,1865253802,2,0,0,2,0,0

In [30]:
f.loc[0:12,'airline':'fatal_accidents_85_99']

,airline,avail_seat_km_per_week,incidents_85_99,fatal_accidents_85_99
0,Aer Lingus,320906734,2,0
1,Aeroflot*,1197672318,76,14
2,Aerolineas Argentinas,385803648,6,0
3,Aeromexico*,596871813,3,1
4,Air Canada,1865253802,2,0
5,Air France,3004002661,14,4
6,Air India*,869253552,2,1
7,Air New Zealand*,710174817,3,0
8,Alaska Airlines*,965346773,5,0
9,Alitalia,698012498,7,2
10,All Nippon Airways,1841234177,3,1
11,American*,5228357340,21,5
12,Austrian Airlines,358239823,1,0

In [31]:
a=np.array([0,1,2,3])

In [32]:
print(type(a))

<class 'numpy.ndarray'>

In [33]:
print(a.dtype)

int32

In [34]:
print(a.size)

4

<h4>Dimensions</h4>

In [35]:
print(a.ndim)

1

<h4>Shape</h4>

In [36]:
print(a.shape)

(4,)

<h3>Slicing and Indexing</h3>

In [39]:
a=np.array([2,7,4,9,6])

In [40]:
a[0]=23
a

array([23,  7,  4,  9,  6])

In [44]:
a[3]=0
a

array([23,  0,  4,  0,  6])

In [50]:
list1=[1,2,3,4]

In [54]:
#Get shape
a.shape

(5,)

In [57]:
a.dtype
a.nbytes

20

In [60]:
a=np.array([[1,2,3,4,5,6,7],[8,9,10,11,12,13,14]])
print(a)

[[ 1  2  3  4  5  6  7]
 [ 8  9 10 11 12 13 14]]

In [61]:
a.shape

(2, 7)

In [62]:
a.size

14

In [66]:
#getting a specific column
a[:,2]

array([ 3, 10])

In [68]:
#getting a specific row
a[1,:]

array([ 8,  9, 10, 11, 12, 13, 14])

In [73]:
#ones
aq=np.ones((3,3,3))
print(aq)

[[[1. 1. 1.]
  [1. 1. 1.]
  [1. 1. 1.]]

 [[1. 1. 1.]
  [1. 1. 1.]
  [1. 1. 1.]]

 [[1. 1. 1.]
  [1. 1. 1.]
  [1. 1. 1.]]]

In [75]:
#zeros
aq=np.zeros((2,2,2))
print(aq)

[[[0. 0.]
  [0. 0.]]

 [[0. 0.]
  [0. 0.]]]

In [76]:
#consisting of same number
aq=np.full((2,2),19)
aq

array([[19, 19],
       [19, 19]])

In [84]:
#random randint examples
np.random.rand(1,4)

array([[0.6125165 , 0.47274817, 0.22116534, 0.60393277]])

In [85]:
#random/randint
np.random.randint(4,7,size=(3,3,2))

array([[[5, 4],
        [6, 5],
        [6, 4]],

       [[6, 6],
        [4, 4],
        [4, 4]],

       [[6, 5],
        [4, 6],
        [6, 6]]])

In [86]:
#idenity matrix
np.identity(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [96]:
output=np.ones((5,5))
print(output)

z=np.zeros((3,3))
print(z)

z[1,1]=9
print(z)
output[1:4,1:4]=z
print(output)

[[1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]]
[[0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]]
[[0. 0. 0.]
 [0. 9. 0.]
 [0. 0. 0.]]
[[1. 1. 1. 1. 1.]
 [1. 0. 0. 0. 1.]
 [1. 0. 9. 0. 1.]
 [1. 0. 0. 0. 1.]
 [1. 1. 1. 1. 1.]]

<h4>Copying arrays carefully</h4>

In [100]:
a=[1,2,3]
b=a.copy()
print(b)
b[0]=100
print(b)
print(a)

[1, 2, 3]
[100, 2, 3]
[1, 2, 3]

In [101]:
#taking sine of all values
np.sin(a)

array([0.84147098, 0.90929743, 0.14112001])

In [103]:
#taking cosine of all values
np.cos(b)

array([ 0.86231887, -0.41614684, -0.9899925 ])

In [104]:
#multiplication of arrays
a*b
#error in case of lists

TypeError: can't multiply sequence by non-int of type 'list'

In [105]:
#multiplication of arrays with numpy arrays
a=np.array([1,2,3])
b=np.array([2,5,8])
a*b

array([ 2, 10, 24])

In [106]:
a+b

array([ 3,  7, 11])

In [107]:
a+2

array([3, 4, 5])

In [118]:
apple=np.random.randint(1,4,size=(2,3))
apple

array([[3, 3, 3],
       [1, 3, 1]])

In [119]:
ban=np.random.randint(1,4,size=(3,2))
print(ban)

[[3 2]
 [1 3]
 [1 1]]

In [120]:
np.matmul(apple,ban)

array([[15, 18],
       [ 7, 12]])

In [122]:
p=np.random.randint(2,30,size=(3,4))
print(p)

[[25  3 24 15]
 [25 28  2  3]
 [24 21 11 28]]

In [123]:
q=np.random.randint(2,30,size=(4,3))
print(q)

[[11  9 24]
 [17 11 10]
 [15 16 14]
 [13 22 22]]

In [124]:
np.vdot(p,q)

3233

In [125]:
np.dot(p,q)

array([[ 881,  972, 1296],
       [ 820,  631,  974],
       [1150, 1239, 1556]])

<h2>Complex Numbers</h2>

In [129]:
np.angle(1+1j,1.0j)

45.0

In [132]:
np.angle(9.2+4.2j,deg='True')

24.537728476577797